#+Title: Automated Repair of Exploits in NETGEAR Router Binary
#+Author: Eric Schulte and Westley Weimer and Stephanie Forrest
#+Options: toc:nil ^:{}
#+HTML_Head: <link rel="stylesheet" type="text/css" href="../etc/netgear-repair.css" />
#+LaTeX_Class: sigcomm-alternative
#+LaTeX: \usetikzlibrary{arrows,decorations,decorations.pathreplacing,shapes}

#+LaTeX: \begin{abstract}
The speed with which researchers and vendors respond to security
vulnerabilities is critical, especially after exploits have been
discovered.  The situation is especially dire for end users who lack
product source code and typically must wait for a patch to be released
by the vendor.  We propose an alternative approach in which newly
discovered exploits drive an automated repair technique capable of
patching vulnerabilities, even without access to source code or
special information from the software vendor.

The repair method uses evolutionary computation to search for patches.
Extensions to earlier work include: Repairing security vulnerabilities
in router binaries; special processing to handle stripped ELF files;
operating without fault localization information; and operating
without a pre-existing regression test suite to define required
program behavior.

We demonstrate the method by repairing two recently discovered
exploits in version 4 of NETGEAR's WNDR3700 wireless router /before/
NETGEAR released patches publicly for the exploits.  Without the
advantage of regression tests to guide the search, we find that 80% of
repairs of the example exploits retain program functionality.  When a
few user-created tests of required functionality are incorporated in
an interactive process, success increases to 100% of the proposed
repairs.
#+LaTeX: \end{abstract}

*** The impact of Minimization
    :PROPERTIES:
    :CUSTOM_ID: minimization
    :END:

In some cases the initial suggested repair, known as the /primary/
repair, was not satisfactory.  For example, suggested repairs
sometimes worked when =net-cgi= was called directly on the command
line but not through the embedded uHTTPd webserver [fn:6], or the
repaired file failed to serve pages not used in the exploit test.
However, Table [[minimized-stats]] shows that in most cases the minimized
version of the repair was satisfactory, successfully passing all
hand-written regression tests, even those not used during the repair
process.

#+label: minimized-stats
#+name: minimized-stats
#+Caption: The evolved repair before and after minimization.  In these columns "Full" refers to evolved solutions before minimization and "Min" refers to solutions after.  Columns labeled "Diff" report the number of unified diff windows against the original program data. The columns labeled "Fit" report fitness as measured with a full regression test suite, including the exploit tests.  The maximum possible fitness score is 22, indicating a successful repair.
|  Run | Fit Evals | Full Diff | Min Diff | Full Fit | Min Fit |
|------+-----------+-----------+----------+----------+---------|
|    0 |     90405 |       500 |        2 |        8 |      22 |
|    1 |     17231 |       134 |        3 |       22 |      22 |
|    2 |     26879 |       205 |        2 |       21 |      22 |
|    3 |     23764 |       199 |        2 |       19 |      22 |
|    4 |     47906 |       319 |        2 |        6 |       6 |
|    5 |     13102 |        95 |        2 |       16 |      22 |
|    6 |     76960 |       556 |        3 |       17 |      22 |
|    7 |     11831 |        79 |        3 |       20 |      22 |
|    8 |      2846 |        10 |        1 |       14 |      14 |
|    9 |     25600 |       182 |        2 |       21 |      22 |
|------+-----------+-----------+----------+----------+---------|
| mean |   33652.4 |     227.9 |      2.2 |     16.4 |    19.6 |
#+TBLFM: @12$2=vmean(@2..@-1)::@12$3=vmean(@2..@-1)::@12$4=vmean(@2..@-1)::@12$5=vmean(@2..@-1)::@12$6=vmean(@2..@-1)

As shown in Table [[minimized-stats]], the initial evolved repair differed
from the original at over 200 locations on average in the ELF program
data, while the minimized repairs differed at only 1--3 locations on
average.  This great discrepancy is due to the accumulation of
candidate edits in non-tested portions of the program data.  Since
these portions of the program were not tested, there was no
evolutionary pressure to purge the harmful edits.  Delta Debugging
eliminates these edits.

